module vga32
(
    input               clock,
    input               rst_n,
    // ---
    output  reg         hs,
    output  reg         vs,
    output  reg [11:0]  rgb,
    // ---
    output  reg [15:0]  a,
    input       [31:0]  i
);

// ---------------------------------------------------------------------
// Тайминги для горизонтальной|вертикальной развертки (1440x900)
// ---------------------------------------------------------------------

localparam
//  Видимый    Back      Sync      Front     ALL
    hzv = 720, hzb = 116, hzs = 96, hzf = 40, hzw = 952,
    vtv = 900, vtb = 25,  vts = 6,  vtf = 3,  vtw = 934;

// ---------------------------------------------------------------------
wire   vi = (x >= hzb && x < hzb+hzv) && (y >= vtb && y < vtb+vtv);
wire   ws = (xc >= 8 && xc < 648) && (yc < 800);
// ---------------------------------------------------------------------
reg  [31:0] d;
reg  [ 9:0] x    = 0;
reg  [ 9:0] y    = 0;
wire [ 9:0] xc   = x - hzb - 40 + 8;
wire [ 9:0] yc   = y - vtb - 50;
wire        xmax = (x == hzw - 1);
wire        ymax = (y == vtw - 1);
// ---------------------------------------------------------------------
// Младший байт будет первыми 2-мя пикселями (0,1)
wire [ 3:0] cp = d >> {3'b001 ^ xc[2:0], 2'b0};
wire [11:0] cl = {192'hFFF_FF0_F0F_F00_0FF_0F0_00F_888_CCC_880_808_800_088_080_008_111} >> (12*cp);
// ---------------------------------------------------------------------

always @(posedge clock) begin

    rgb <= 12'h000;

    // Кадровая развертка
    hs <= x  < (hzb + hzv + hzf); // NEG
    vs <= y >= (vtb + vtv + vtf); // POS
    x  <= xmax ?         0 : x + 1;
    y  <= xmax ? (ymax ? 0 : y + 1) : y;

    // Вывод окна видеоадаптера
    if (vi) rgb <= ws ? cl : 12'h111;

    case (xc[2:0])
    3'b000: a <= xc[9:3] + yc[9:1]*80 + 16'h8000;
    3'b111: d <= i;
    endcase

end

endmodule
