module vga32
(
    input               clock,
    input               rst_n,
    // ---
    output  reg         hs,
    output  reg         vs,
    output  reg [11:0]  rgb,
    // ---
    output  reg [15:0]  a,
    input       [31:0]  i
);

// ---------------------------------------------------------------------
// Тайминги для горизонтальной|вертикальной развертки (640x400)
// ---------------------------------------------------------------------

localparam
//  Видимый    Back      Sync      Front     ALL
    hzv = 640, hzb = 48, hzs = 96, hzf = 16, hzw = 800,
    vtv = 400, vtb = 35, vts = 2,  vtf = 12, vtw = 449;

// ---------------------------------------------------------------------
wire   ws = (x >= hzb && x < hzb + hzv) && (y >= vtb && y < vtb + vtv);
// ---------------------------------------------------------------------
reg  [ 9:0] x    = 0;
reg  [ 8:0] y    = 0;
reg  [31:0] d;
wire [ 9:0] xc   = x - hzb + 8;
wire [ 8:0] yc   = y - vtb;
wire        xmax = (x == hzw - 1);
wire        ymax = (y == vtw - 1);
// ---------------------------------------------------------------------
// Младший байт будет первыми 2-мя пикселями (0,1)
wire [ 3:0] cp = d >> {3'b001 ^ xc[2:0], 2'b0};
wire [11:0] cl = {192'hFFF_FF0_F0F_F00_0FF_0F0_00F_888_CCC_880_808_800_088_080_008_111} >> (12*cp);
// ---------------------------------------------------------------------

always @(posedge clock) begin

    rgb <= 12'h000;

    // Кадровая развертка
    hs <= x  < (hzb + hzv + hzf); // NEG
    vs <= y >= (vtb + vtv + vtf); // POS
    x  <= xmax ?         0 : x + 1;
    y  <= xmax ? (ymax ? 0 : y + 1) : y;

    // Вывод окна видеоадаптера
    if (ws) rgb <= cl;

    case (xc[2:0])
    3'b000: a <= xc[9:3] + yc*80 + 16'h8000;
    3'b111: d <= i;
    endcase

end

endmodule
